app/views/show/index.html.erb

  <link rel="stylesheet" href="/font-awesome.min.css"> <!-- Font Awesome, https://fortawesome.github.io/Font-Awesome/ -->
  <link rel="stylesheet" href="/bootstrap.min.book.css">                       <!-- Bootstrap style, http://v4-alpha.getbootstrap.com/ -->
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]