app/controllers/book_controller.rb

  def create


    @title = params[:title]
    @author = params[:author]
    @edition = params[:edition]
    @cid = params[:abstract]
    @isbn = params[:isbn_no]
    @msg = params[:description]
    @user_id=session[:currentUserID]
    @category = params[:category]
    @publisher = params[:publisher]
    @book = Book.create!(:title => @title, :author => @author, :edition => @edition, :abstract => @cid, :isbn_no =>  @isbn, :descriptors => @msg, :user_id => @user_id, :category => @category, :publisher => @publisher)
---
INSERT INTO "books" ("title", "author", "category", "isbn_no", "edition", "abstract", "publisher", "descriptors", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def delete
    id = params[:id]
    @book = Book.find(id)
    @book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]