app/controllers/find_controller.rb

  def index
    if (params.has_key?('search'))


      @books=Book.where('title LIKE ?', "%#{params[:search]}%")
      @tag=params[:search]

    else
      @books=Book.all
---
SELECT "books".* FROM "books" WHERE (title LIKE '%testbook%')
SELECT "books".* FROM "books"