app/controllers/show_controller.rb

  def index
    id = params[:id]
    @book = Book.find(id)
    @user = User.find(@book.user_id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def books
    @books = Book.where(:user_id => session[:currentUserID])
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]