app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE (email='test@example.com' and password_digest='123') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "users" WHERE (email=NULL and password_digest=NULL)
---
    def signin
      @email = params[:SignInEmail]
      @password = params[:SignInPassword]
      @result=User.where(["email=? and password_digest=?", @email,@password])
      if @result.count!=0

INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest", "name") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      begin
      @username = params[:Username]
      @name=params[:Name]
      @email = params[:SignUpEmail]
      @password = params[:SignUpPassword]

      @user = User.create!(:username => @username, :email => @email, :password_digest => @password, :name => @name)